#-------------------------------------------------------
# Expectation of rectifier
# ∫ N(x|μ, σ) r(α⋅x+b) dx, 
# where r(x) = 0 if α⋅x+b<0, otherwise r(x)=α⋅x+b
#-------------------------------------------------------

M(μ, σ) = μ*Φ(μ/σ) + σ*ϕ(μ/σ)

M(α, μ, σ) = M(α*μ, α*σ)

M(α, b, μ, σ) = M(α*μ+b, α*σ)


#-------------------------------------------------------
# Expectation of squared rectifier
# ∫ N(x|μ, σ) r(α⋅x+b)² dx
#-------------------------------------------------------

B(μ, σ) = V(μ, σ) + M(μ, σ)^2

B(α, b, μ, σ) = B(α*μ+b, α*σ)

B_alternative(α, b, μ, σ) = V(α*μ+b, α*σ) + M(α*μ+b, α*σ)^2 # used only for verification purposes

#-------------------------------------------------------
# Variance of rectifier
# ∫ N(x|μ, σ) (r(α⋅x+b) - E[r(α⋅x+b)])² dx
#-------------------------------------------------------

Vslow(μ, σ) = (μ^2 + σ^2)*Φ(μ/σ) + μ*σ*ϕ(μ/σ) - M(μ, σ)^2

function V(μ, σ)

    Φ₀ = Φ(μ/σ)

    ϕ₀ = ϕ(μ/σ)

    M² = (μ*Φ₀ + σ*ϕ₀)^2

    (μ^2 + σ^2)*Φ₀ + μ*σ*ϕ₀ - M²

end

V(a, b, μ, σ) = V(a*μ+b, a*σ)


#-------------------------------------------------------
# Return expectation, variance and expectation of square
#-------------------------------------------------------

function M_V_B(a,b,μ₀,σ₀)

    μ = a*μ₀+b

    σ = a*σ₀

    Φ₀ = Φ(μ/σ)

    ϕ₀ = ϕ(μ/σ)

    Mval = μ*Φ₀ + σ*ϕ₀

    Vval = (μ^2 + σ^2)*Φ₀ + μ*σ*ϕ₀ - Mval^2

    Mval, Vval, Vval + Mval^2

end


#-------------------------------------------------------
# Return both expectation and variance
#-------------------------------------------------------

function M_V(a,b,μ₀,σ₀)

    μ = a*μ₀+b

    σ = a*σ₀

    Φ₀ = Φ(μ/σ)

    ϕ₀ = ϕ(μ/σ)

    Mval = μ*Φ₀ + σ*ϕ₀

    Mval, (μ^2 + σ^2)*Φ₀ + μ*σ*ϕ₀ - Mval^2

end